AUTHOR = r"(((пр\.)|(доц\.)|(проф\.))\s*)?(?P<ath>([А-ЯЁ][А-Яа-яё]+(\s|\.)+(\s|\.)?[А-ЯЁ](\s|\.)+(\s|\.)?[А-ЯЁ]\.?)|(([А-ЯЁ][а-яё]+\s?){3,}))"
DEPARTMENT = r"^\s*\(?(?P<dep>\d+\w?)\)?"
CLASSROOM = r"((БИ|(\d(к.)?))\w?\s?-*(ОД-)?\s?\d+\w?\d?((/\d[^\-/]*)|(\-[\d\w]+))?)|(ЭОиДОТ)|(ООО\s?[«\"][\w-]+[»\"])|(ижводоканал)|(ИжНТ)|(ee\.istu\.ru)"
LESSON_TYPE = r"[\(\s](?P<type>((леке?ц?и?я?\.*)?\s?\+?\s?(практ?и?к?а?\.*)?\s?\+?\s?((л[/\.]\s?р?\.*)|(лаб\.*))?\s?\+?\s?(практ?и?к?а?\.*)?\s?\+?\s?(леке?ц?и?я?\.*)?))(\s\d(,\s?\d)?\sп/гр)?[\)\s]"
LESSON = r'\s*((\(?[\w\s/ё+\.,\-"]+\)\s*)|(\([\w\s/ё+\.,\-"]+\)?\s*))*(?P<name>[\w\sё/+\.,\-"]{3,})(\s*(\([\w\sё/+\.,\-"]+\)\s*))*(,\s*)?'
LESSON_NO_AUTHOR = r"\s*(\(?[\w\s/+\.,-]+\)\s*)*(?P<name>[\w\sё\.-]{3,})(\s*(\([\w\s/+\.,-]+\)\s*))*(,\s*)?"
GROUP = r"[А-Я]\d\d-\d\d\d-\d"
